; domain
(define (domain beluga_prob1-domain)
 (:requirements :strips :typing :negative-preconditions :equality :action-costs)
 (:types
    location num production_line side slot type - object
    beluga hangar jig rack trailer - location
 )
 (:constants
   fside bside - side
   dummy_jig - jig
   dummy_type - type
   dummy_slot - slot
 )
 (:predicates (at_side ?l - location ?s - side) (clear ?j - jig ?s - side) (empty ?l - location) (empty_size ?j - jig ?es - num) (fit ?nspace - num ?jsize - num ?fspace - num ?r - rack) (free_space ?r - rack ?n - num) (in ?j - jig ?l - location) (is_type ?j - jig ?jt - type) (next_flight_to_process ?b - beluga ?nb - beluga) (next_to ?j - jig ?nj - jig ?s - side) (next_deliver ?j - jig ?jn - jig) (next_load ?jt - type ?s_0 - slot ?ns - slot ?b - beluga) (next_unload ?j - jig ?nj - jig) (processed_flight ?b - beluga) (size ?j - jig ?s_1 - num) (to_deliver ?j - jig ?pl - production_line) (to_load ?jt - type ?s_0 - slot ?b - beluga) (to_unload ?j - jig ?b - beluga) (started))
 (:functions (total-cost))
 (:action load_beluga
  :parameters ( ?j - jig ?jt - type ?njt - type ?b - beluga ?t - trailer ?s_0 - slot ?ns - slot)
  :precondition (and (in ?j ?t) (empty ?j) (is_type ?j ?jt) (processed_flight ?b) (to_load ?jt ?s_0 ?b) (next_load ?njt ?s_0 ?ns ?b) (at_side ?t bside) (started))
  :effect (and (in ?j ?b) (not (in ?j ?t)) (empty ?t) (not (to_load ?jt ?s_0 ?b)) (to_load ?njt ?ns ?b) (increase (total-cost) 1)))
 (:action unload_beluga
  :parameters ( ?j - jig ?nj - jig ?t - trailer ?b - beluga)
  :precondition (and (in ?j ?b) (empty ?t) (at_side ?t bside) (processed_flight ?b) (to_unload ?j ?b) (next_unload ?j ?nj) (started))
  :effect (and (not (in ?j ?b)) (in ?j ?t) (not (empty ?t)) (not (to_unload ?j ?b)) (to_unload ?nj ?b) (increase (total-cost) 1)))
 (:action get_from_hangar
  :parameters ( ?j - jig ?h - hangar ?t - trailer)
  :precondition (and (in ?j ?h) (empty ?t) (at_side ?t fside) (started))
  :effect (and (not (in ?j ?h)) (in ?j ?t) (not (empty ?t)) (empty ?h) (increase (total-cost) 1)))
 (:action deliver_to_hangar
  :parameters ( ?j - jig ?jn - jig ?t - trailer ?h - hangar ?pl - production_line ?s_1 - num ?es - num)
  :precondition (and (in ?j ?t) (empty ?h) (at_side ?t fside) (to_deliver ?j ?pl) (next_deliver ?j ?jn) (size ?j ?s_1) (empty_size ?j ?es) (started))
  :effect (and (empty ?t) (empty ?j) (in ?j ?h) (not (in ?j ?t)) (not (empty ?h)) (not (to_deliver ?j ?pl)) (to_deliver ?jn ?pl) (not (size ?j ?s_1)) (size ?j ?es) (increase (total-cost) 1)))
 (:action put_down_rack
  :parameters ( ?j - jig ?t - trailer ?r - rack ?s - side ?jsize - num ?fspace - num ?nspace - num)
  :precondition (and (in ?j ?t) (empty ?r) (at_side ?t ?s) (at_side ?r ?s) (size ?j ?jsize) (free_space ?r ?fspace) (fit ?nspace ?jsize ?fspace ?r) (started))
  :effect (and (in ?j ?r) (not (in ?j ?t)) (empty ?t) (not (empty ?r)) (clear ?j bside) (clear ?j fside) (not (free_space ?r ?fspace)) (free_space ?r ?nspace) (increase (total-cost) 1)))
 (:action stack_rack
  :parameters ( ?j - jig ?nj - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
  :precondition (and (not (= ?s ?os)) (in ?j ?t) (in ?nj ?r) (at_side ?t ?s) (at_side ?r ?s) (clear ?nj ?s) (size ?j ?jsize) (free_space ?r ?fspace) (fit ?nspace ?jsize ?fspace ?r) (started))
  :effect (and (in ?j ?r) (not (in ?j ?t)) (empty ?t) (not (clear ?nj ?s)) (clear ?j ?s) (next_to ?j ?nj ?s) (next_to ?nj ?j ?os) (not (free_space ?r ?fspace)) (free_space ?r ?nspace) (increase (total-cost) 1)))
 (:action pick_up_rack
  :parameters ( ?j - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
  :precondition (and (not (= ?s ?os)) (empty ?t) (in ?j ?r) (at_side ?t ?s) (at_side ?r ?s) (clear ?j bside) (clear ?j fside) (size ?j ?jsize) (free_space ?r ?fspace) (fit ?fspace ?jsize ?nspace ?r) (started))
  :effect (and (in ?j ?t) (not (in ?j ?r)) (empty ?r) (not (empty ?t)) (not (clear ?j bside)) (not (clear ?j fside)) (free_space ?r ?nspace) (not (free_space ?r ?fspace)) (increase (total-cost) 1)))
 (:action unstack_rack
  :parameters ( ?j - jig ?nj - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
  :precondition (and (not (= ?s ?os)) (empty ?t) (in ?j ?r) (in ?nj ?r) (at_side ?t ?s) (at_side ?r ?s) (clear ?j ?s) (next_to ?j ?nj ?s) (next_to ?nj ?j ?os) (size ?j ?jsize) (free_space ?r ?fspace) (fit ?fspace ?jsize ?nspace ?r) (started))
  :effect (and (in ?j ?t) (not (in ?j ?r)) (not (empty ?t)) (not (next_to ?j ?nj ?s)) (not (next_to ?nj ?j ?os)) (clear ?nj ?s) (free_space ?r ?nspace) (not (free_space ?r ?fspace)) (increase (total-cost) 1)))
 (:action beluga_complete
  :parameters ( ?b - beluga ?nb - beluga)
  :precondition (and (processed_flight ?b) (next_flight_to_process ?b ?nb) (to_unload dummy_jig ?b) (to_load dummy_type dummy_slot ?b) (started))
  :effect (and (not (processed_flight ?b)) (processed_flight ?nb) (increase (total-cost) 1)))
 (:action start_
  :parameters ()
  :precondition (and (not (started)))
  :effect (and (started) (increase (total-cost) 0)))
)

; problem
(define (problem beluga_prob1-problem)
 (:domain beluga_prob1-domain)
 (:objects
   beluga1 - beluga
   hangar1 hangar2 hangar3 - hangar
   jig0001 jig0002 - jig
   n00 n04 n06 n09 n13 n15 n18 n22 n25 n31 n40 - num
   pl0 pl1 - production_line
   rack00 rack01 - rack
   beluga_trailer_1 beluga_trailer_2 beluga_trailer_3 factory_trailer_1 factory_trailer_2 - trailer
   typec typed - type
 )
 (:init (fit n04 n18 n22 rack00) (fit n13 n09 n22 rack00) (fit n04 n09 n13 rack00) (fit n15 n25 n40 rack01) (fit n22 n18 n40 rack01) (fit n31 n09 n40 rack01) (fit n04 n09 n13 rack01) (fit n06 n09 n15 rack01) (fit n04 n18 n22 rack01) (fit n13 n09 n22 rack01) (fit n06 n25 n31 rack01) (fit n13 n18 n31 rack01) (fit n22 n09 n31 rack01) (empty beluga_trailer_1) (at_side beluga_trailer_1 bside) (empty beluga_trailer_2) (at_side beluga_trailer_2 bside) (empty beluga_trailer_3) (at_side beluga_trailer_3 bside) (empty factory_trailer_1) (at_side factory_trailer_1 fside) (empty factory_trailer_2) (at_side factory_trailer_2 fside) (empty rack00) (at_side rack00 bside) (at_side rack00 fside) (free_space rack00 n22) (at_side rack01 bside) (at_side rack01 fside) (free_space rack01 n15) (in jig0001 rack01) (clear jig0001 bside) (clear jig0001 fside) (is_type jig0001 typed) (size jig0001 n25) (empty_size jig0001 n18) (is_type jig0002 typec) (size jig0002 n18) (empty_size jig0002 n09) (empty hangar1) (empty hangar2) (empty hangar3) (processed_flight beluga1) (to_unload jig0002 beluga1) (in jig0002 beluga1) (next_unload jig0002 dummy_jig) (to_load dummy_type dummy_slot beluga1) (to_deliver jig0002 pl0) (next_deliver jig0002 dummy_jig) (to_deliver jig0001 pl1) (next_deliver jig0001 dummy_jig) (started) (= (total-cost) 0))
 (:goal (and (empty jig0002) (empty jig0001) (to_unload dummy_jig beluga1) (to_load dummy_type dummy_slot beluga1)))
 (:metric minimize (total-cost))
)

; plan
1. (pick_up_rack jig0001 factory_trailer_1 rack01 fside bside n25 n15 n40)
   deleted: (in jig0001 rack01) (empty factory_trailer_1) (clear jig0001 bside) (clear jig0001 fside) (free_space rack01 n15)
   added: (in jig0001 factory_trailer_1) (empty rack01) (free_space rack01 n40)
   goals met: 1 of 4
2. (unload_beluga jig0002 dummy_jig beluga_trailer_1 beluga1)
   deleted: (in jig0002 beluga1) (empty beluga_trailer_1) (to_unload jig0002 beluga1)
   added: (in jig0002 beluga_trailer_1) (to_unload dummy_jig beluga1)
   goals met: 2 of 4
3. (put_down_rack jig0002 beluga_trailer_1 rack00 bside n18 n22 n04)
   deleted: (in jig0002 beluga_trailer_1) (empty rack00) (free_space rack00 n22)
   added: (in jig0002 rack00) (empty beluga_trailer_1) (clear jig0002 bside) (clear jig0002 fside) (free_space rack00 n04)
   goals met: 2 of 4
4. (pick_up_rack jig0002 factory_trailer_2 rack00 fside bside n18 n04 n22)
   deleted: (in jig0002 rack00) (empty factory_trailer_2) (clear jig0002 bside) (clear jig0002 fside) (free_space rack00 n04)
   added: (in jig0002 factory_trailer_2) (empty rack00) (free_space rack00 n22)
   goals met: 2 of 4
5. (deliver_to_hangar jig0002 dummy_jig factory_trailer_2 hangar1 pl0 n18 n09)
   deleted: (in jig0002 factory_trailer_2) (empty hangar1) (to_deliver jig0002 pl0) (size jig0002 n18)
   added: (empty factory_trailer_2) (empty jig0002) (in jig0002 hangar1) (to_deliver dummy_jig pl0) (size jig0002 n09)
   goals met: 3 of 4
6. (deliver_to_hangar jig0001 dummy_jig factory_trailer_1 hangar2 pl1 n25 n18)
   deleted: (in jig0001 factory_trailer_1) (empty hangar2) (to_deliver jig0001 pl1) (size jig0001 n25)
   added: (empty factory_trailer_1) (empty jig0001) (in jig0001 hangar2) (to_deliver dummy_jig pl1) (size jig0001 n18)
   goals met: 4 of 4
